<template>
    <div class="d-flex flex-column main-billiards" :style="{ filter: brightnessValue }">
        <div class="head-billiards"></div>
        <div class="body-billiards d-flex justify-content-center">
            <div class="d-flex justify-content-center introduction flex-column dir-rtl p-5 mb-5">

                <div class="dir-rtl d-flex flex-column justify-content-center">
                    <h3>
                        ورزش بیلیارد و اسنوکر
                    </h3>
                    <p class="mb-0">
                        <strong> بیلیارد</strong>
                        نوعی بازی ضربه‌ای است که در فضای سرپوشیده و روی میزی مستطیل‌شکل بازی می‌شود. بازیکنان
                        بیلیارد با میله‌ای چوبی، به گوی‌هایی که به آن‌ها
                        <a href="" class="text-warning"> توپ بیلیارد </a>
                        (شار) گفته می‌شود، ضربه می‌زنند و
                        مشغول بازی می‌شوند.
                    </p>
                    <p class="mb-0">
                        ورزش بیلیارد بر اساس دسته بندی فدراسیون جهانی به دو رشته
                        <strong> پاکت بیلیارد </strong>
                        (pocket billiard) و
                        <strong> اسنوکر </strong>
                        (snooker)
                        تقسیم‌بندی می‌شود که در این مقاله قصد داریم به معرفی بیشتر اسنوکر در کنار بازی
                        بیلیارد بپردازیم.


                    </p>

                    <div class="d-flex justify-content-center mt-5">
                        <img src="../../assets/billiards/home/introduction1.webp" alt="" class="intro_images">
                    </div>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        تاریخچه بازی بیلیارد
                    </h3>
                    <p class="mb-0">
                        تاریخ اختراع و کشور مخترع بازی بیلیارد مشخص نیست اما تا قرن پانزدهم میلادی این بازی در اروپای
                        شمالی و فرانسه بر روی چمن انجام می‌شد و در میان مردم محبوبیت داشت. بعد از مدتی این بازی به
                        مکان‌های سرپوشیده تغییر مکان یافت و بازی بر روی میزی پوشیده از پارچه سبز رنگ که شبیه به چمن بوده
                        انجام می‌شد.
                    </p>
                    <p class="mb-0">
                        قبل از سال 1800 این بازی به عنوان بیلیارد اعیان زادگان شناخته می‌شد. به مرور زمان مردم آشنایی
                        کافی با این بازی پیدا کردند، به طوری که شکسپیر در کتاب آنتونی و کلئوپاترا به آن اشاره کرده است و
                        این اشاره نشان از حضور بیلیارد در کشور انگلستان در دوران شکسپیر است.
                    </p>
                    <p class="mb-0">
                        بیلیارد در ایران با روشی برگرفته از
                        <strong> روسیه </strong>
                        بازی می‌شود و اصطلاحاتی روسی نیز در میان بازیکنان به
                        کار برده می‌شود. به عنوان مثال هر یک از توپ‌ها را شار که معادل کلمه گوی در زبان روسی است
                        می‌خوانند.


                    </p>
                    <div class="d-flex justify-content-center mt-5">
                        <img src="../../assets/billiards/home/introduction2.webp" alt="" class="intro_images">
                    </div>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        تجهیزات مورد نیاز ورزش بیلیارد
                    </h3>
                    <div>
                        <ul style="list-style-type: decimal;">
                            <li class="p-2">
                                <p>
                                    <a href="" class="text-warning"> میز بیلیارد </a>
                                    : برای بازی بیلیارد به یک میز با ابعاد تقریبی 137.155 سانتی‌متر عرض و
                                    274.23 سانتی‌متر طول نیاز است. سطح میز با یک رویه رنگی مخملی از جنس پلی استر و پشم
                                    پوشیده شده و میز دارای 6 حفره است.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> توپ بیلیارد </strong>
                                    : 15 توپ بیلیارد به کار رفته در بازی‌های امروزی از جنس پلی استر بوده که
                                    نسبت به انواع قدیمی‌تر خود پایدارتر و ارزان‌تر هستند. در گذشته توپ‌های بیلیارد از
                                    عاج، خاک رس و ترکیبات دیگر ساخته می‌شدند.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> چوب بیلیارد </strong>
                                    :
                                    <a href="" class="text-warning"> چوب بیلیارد </a>
                                    شامل نوک، بدنه و دسته بوده و دارای طول استاندارد یک متر و
                                    47 سانتی‌متر است. معمولی‌ترین وزن برای چوب بیلیارد 510 گرم تا 595 گرم است. برای
                                    بررسی دقیق تر چوب بیلیارد باید بگوییم
                                    <strong> نوک چوب </strong>
                                    قسمتی است که مقداری سفید و با طول
                                    تقریبا برابر 1.27 سانتی‌متر است و یک قسمت کائوچویی در نوک وجود دارد،
                                    <strong> بدنه </strong>
                                    قسمتی صاف
                                    و صیقلی، کم پهنا و بلند است و در قسمت میانه چوب قرار می‌گیرد و
                                    <strong> دسته </strong>
                                    نیز پر پهناترین
                                    قسمت چوب است که به صورت مخروطی به طرف میانه و نوک پیش می‌رود.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> راک </strong>
                                    :یک شی سه گوش، که بازیکن برای مرتب کردن توپ‌ها از آن استفاده می‌کند. در هنگام
                                    استفاده از راک تمامی توپ‌ها در درون آن قرار می‌گیرند.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> گچ </strong>
                                    : برای ضربه زدن بهتر چوب به توپ از گچ استفاده می‌شود. با مالیدن مقداری گچ به نوک
                                    کائوچویی چوب، چوب در هنگام ضربه زدن به توپ بهتر به آن می‌چسبد و ضربه دقیق‌تری را
                                    خواهیم داشت.
                                </p>
                            </li>

                        </ul>
                    </div>
                    <div class="d-flex justify-content-center mt-5">
                        <img src="../../assets/billiards/home/introduction3.webp" alt="" class="intro_images">
                    </div>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        سرگذشت بازی بیلیارد در ایران
                    </h3>
                    <p class="mb-0">
                        ورزش بیلیارد پس از انقلاب ایران در سال 1357 مورد تحریم روحانیون شیعه قرار گرفت و از این ورزش به
                        عنوان نماد حکومت شاهنشاهی یاد می‌شد. در آن زمان این ورزش حرام و ممنوع اعلام شد و سازندگان و
                        فروشندگان تجهیزات بیلیارد مورد تعقیب قرار گرفتند.
                    </p>
                    <p class="mb-0">
                        در سال 1380 با تاسیس
                        <strong> فدراسیون بولینگ و بیلیارد جمهوری اسلامی ایران </strong>
                        ، ورزش بیلیارد به رسمیت شناخته
                        شده و از آن پس بیلیارد در ایران به صورت یک ورزش همگانی در آمده است.
                    </p>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        اسنوکر
                    </h3>
                    <p class="mb-0">
                        بازی اسنوکر شکلی از بیلیارد است که روی میز بزرگی از جنس فلانل بازی می‌شود.
                        <a href="" class="text-warning"> میز اسنوکر </a>
                        دارای شش حفره (پاکت) است که چهار پاکت در چهارگوشه میز و دو پاکت دیگر در وسط کناره میز قرار
                        دارند.
                    </p>
                    <p class="mb-0">
                        در گذشته اسنوکر بر روی چمن انجام می‌شد و در زمین چمنی بازیکنان با عصا ذربه‌ها را به توپ وارد
                        می‌کردند. رنگ سبز به‌ کار رفته بر روی میزهای اسنوکر کنونی برگرفته از زمین چمنی دوران قدیم است و
                        البته امروزه به جای عصا از میله‌های چوبی برای ضربه به توپ استفاده می‌شود.
                    </p>
                    <p class="mb-0">
                        اسنوکر در فرهنگ لغت انگلیسی به معنی زیرک بوده و معنی آن در بازی پنهان کردن، از دسترس دور کردن،
                        سد کردن و ماسک کردن است.
                    </p>
                    <div class="d-flex justify-content-center mt-5">
                        <img src="../../assets/billiards/home/introduction4.webp" alt="" class="intro_images">
                    </div>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        توپ‌ها در اسنوکر
                    </h3>
                    <p class="mb-0">
                        در اسنوکر بر خلاف بازی مادر از 21 توپ استفاده می‌شود که 15 توپ قرمز رنگ، یک توپ مشکی، یک توپ
                        صورتی، یک توپ آبی، یک توپ قهوه‌ای، یک توپ سبز و یک توپ زرد به کار برده می‌شود.
                    </p>
                    <p class="mb-0">
                        هر کدام از این توپ‌های رنگی امتیاز مخصوص به خود را دارند که این امتیاز دهی به صورت زیر است.
                    </p>
                    <p class="mb-0">
                        توپ قرمز یک امتیاز، توپ مشکی ۷ امتیاز، توپ صورتی ۶ امتیاز، توپ آبی ۵ امتیاز، توپ قهوه‌ای ۴
                        امتیاز، توپ سبز ۳ امتیاز و توپ زرد ۲ امتیاز دارد.
                    </p>
                    <div class="d-flex justify-content-center mt-5">
                        <img src="../../assets/billiards/home/introduction5.webp" alt="" class="intro_images">
                    </div>
                </div>

                <div class="dir-rtl mt-5">
                    <h3>
                        تجهیزات مورد نیاز ورزش اسنوکر
                    </h3>
                    <p class="mb-0">
                        بعضی از
                        <a href="" class="text-warning"> لوازم جانبی اسنوکر </a>
                        برای انجام یک بازی حرفه‌ای‌تر و راحت‌تر ضروری هستند. مهمترین آن‌ها را
                        در اینجا فهرست کرده‌ایم.
                    </p>
                    <div class="mt-5">
                        <ul style="list-style-type: decimal;">
                            <li class="p-2">
                                <p>
                                    <strong> گچ </strong>
                                    : برای برقراری تماس مناسب‌تر بین چوب و شار سفید از آن استفاده می‌شود.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> چوب </strong>
                                    : برای ضربه زدن به شار از آن استفاده می‌شود و از جنس چوب یا فایبرگلاس است.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> رست </strong>
                                    : از نظر ظاهری مانند چوب عادی با سر X مانند است و زمانی استفاده می‌شود که شار سفید
                                    در دسترس نباشد.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> مثلث </strong>
                                    : برای چیدن شارهای قرمز رنگ در شروع بازی به کار می‌رود.
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> رست و چوب بلند </strong>
                                    : برای زدن شار(توپ) سفید هنگامی که توسط چوب ورست عادی قابل دسترسی
                                    نباشد استفاده می‌شود .
                                </p>
                            </li>

                            <li class="p-2">
                                <p>
                                    <strong> اکستنشن </strong>
                                    : اکستنشن همان ته چوب است که امروزه به جای چوب بلند از آن استفاده می‌شود.
                                </p>
                            </li>

                        </ul>
                    </div>

                </div>

                <div class="dir-rtl mt-5 mb-5">

                    <p class="mb-0">
                        <strong> فروشگاه اینترنتی بیلیارد و اسنوکر لوزی </strong>
                        ،
                        که به عنوان یکی از مراکز فروش معتبر اینترنتی
                        <strong> بیلیارد و اسنوکر </strong>
                        در تهران شناخته شده است، آماده خدمت رسانی به شما عزیزان است. تمامی محصولات مورد نیاز خود
                        را با اعتماد به اصل بودن از ما تهیه کنید.
                    </p>
                    <p class="mb-5">
                        در هنگام خرید اگر نیاز به راهنمایی داشتید با پشتیبانی تماس حاصل فرمایید.
                    </p>
                </div>

            </div>
        </div>
    </div>
</template>

<script>
import { inject } from 'vue';

export default {

    setup() {
        const brightnessValue = inject('brightnessValue');

        return {
            brightnessValue,
        };
    },
};  
</script>
<style src="../../assets/billiards/home/billiards_style.css" scoped></style>
